tap "beeftornado/rmtree"
tap "cmacrae/formulae"
tap "codecrafters-io/tap"
tap "doprz/dipc"
tap "felixkratz/formulae"
tap "fsouza/prettierd"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "oven-sh/bun"
tap "tabbyml/tabby"
tap "zen-browser/browser", "https://github.com/zen-browser/desktop.git"
brew "autoconf-archive"
brew "automake"
brew "awk"
brew "openssl@3"
brew "bat"
brew "python@3.11"
brew "bpytop"
brew "fftw"
brew "iniparser"
brew "portaudio"
brew "cava"
brew "unbound"
brew "libmicrohttpd"
brew "tesseract"
brew "ffmpeg"
brew "cmatrix"
brew "deno"
brew "docker", link: false
brew "docker-compose"
brew "node"
brew "eslint"
brew "eza"
brew "fd"
brew "feh"
brew "fluid-synth"
brew "flyctl"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git"
brew "glow"
brew "glyr"
brew "highlight"
brew "libheif"
brew "libtool"
brew "imagemagick"
brew "jq"
brew "libcaca"
brew "libicns"
brew "libxft"
brew "localtunnel"
brew "lolcat"
brew "lsusb"
brew "luarocks"
brew "luv"
brew "mpc"
brew "mpd"
brew "mpv"
brew "ncurses"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "nvm"
brew "payload-dumper-go"
brew "pfetch"
brew "pkg-config"
brew "pkgconf"
brew "pnpm", link: false
brew "python@3.10"
brew "ranger"
brew "ripgrep"
brew "sassc"
brew "scrcpy"
brew "starship"
brew "stow"
brew "tmux"
brew "typescript"
brew "wallpaper"
brew "wget"
brew "zoxide"
brew "zsh-autosuggestions"
brew "codecrafters-io/tap/codecrafters"
brew "doprz/dipc/dipc"
brew "felixkratz/formulae/borders"
brew "fsouza/prettierd/prettierd"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
brew "oven-sh/bun/bun"
brew "tabbyml/tabby/tabby"
cask "android-platform-tools"
cask "android-studio"
cask "anydesk"
cask "arc"
cask "asset-catalog-tinkerer"
cask "background-music"
cask "discord"
cask "docker"
cask "figma"
cask "fleet"
cask "font-cascadia-code-nf"
cask "font-fira-code-nerd-font"
cask "font-fontawesome"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-maple"
cask "font-monocraft"
cask "font-ubuntu"
cask "hammerspoon"
cask "heroic"
cask "hiddenbar"
cask "httpie"
cask "iina"
cask "karabiner-elements"
cask "keka"
cask "kitty"
cask "maccy"
cask "macfuse"
cask "macs-fan-control"
cask "modrinth"
cask "obs"
cask "pika"
cask "protonvpn"
cask "raycast"
cask "shottr"
cask "sidequest"
cask "temurin"
cask "ubersicht"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp@beta"
cask "whisky"
cask "xquartz"
cask "zed"
cask "zen-browser"
cask "zoom"
cask "zulu17"
cask "zulu8"
vscode "antiantisepticeye.vscode-color-picker"
vscode "be5invis.vscode-custom-css"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "dlasagno.wal-theme"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "etsi0.class-collapse"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.atom-keybindings"
vscode "ms-vscode.remote-explorer"
vscode "naumovs.color-highlight"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "tabbyml.vscode-tabby"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "wix.vscode-import-cost"
